label jenya_bad_end:

    show jenya sad homea at right2 with dissolve
    j "Нет, ты не понимаешь. Они точно меня не поймут. Надо просто смириться. Надо просто смириться, так будет лучше для всех."

    #show mc sad homea at left2 with dissolve
    show mc sad home ca at left2 with dissolve
    mc "Но будет ли лучше для тебя?"

    j "Не знаю, но что ты мне предлагаешь?! Бросить всё и перепоступить?! Это не так просто!"

    mc "Да, непросто сразу решиться на серьёзный шаг. Давай начнём с малого."

    #show mc normal homea at left2 with dissolve
    show mc normal home ca at left2 with dissolve
    mc "Вот сдашь ты этот экзамен и станешь на шаг ближе к тому, чтобы легко перепоступить туда, куда хочешь."

    "Я ожидал какой-то реакции, но Женя ничего больше не сказала."
    #hide mc normal homea with dissolve
    hide mc normal home ca with dissolve
    hide jenya sad homea with dissolve
    stop music fadeout 2.0

    "Мы вернулись к учёбе. Спустя полчаса мы наконец-то закончили. Вроде к экзамену готовы… Голова уже раскалывалась от количества информации, а мы с Женей очень устали."

    "Немного поболтав, мы решили расходиться по комнатам. Женя была уставшая, но наше занятие помогло ей получше понять многие темы, так что я уверен, что оно было не зря."

    "Я проводил Женю и пожелал ей высыпаться и хорошо отдохнуть. Мы распрощались, и я пошёл готовиться ко сну."

    scene bg_room_morning with dissolve

    "Я лёг в кровать, но на душе было как-то тревожно. Я думал о Жене. Меня расстраивали её ссоры с родителями. Мне хотелось ей как-то помочь, но я понимал, что ничего не могу поделать в этой ситуации."

    "Завтрашний экзамен меня тоже беспокоил. Тяжело, конечно, быть студентом. Вечный поток информации, сессия, экзамены… Это всё так выматывает."

    "Ладно, утро вечера мудренее. Лучше лечь спать. Мои переживания только помешают завтра на экзамене. Надо выспаться, чтобы всё успешно сдать."

    scene black with off

    play background wind
    show snow1
    show snow2
    with dissolve

    "Конец января. Давно у меня не было возможности стоять и просто любоваться снежинками. Они, маленькие, совсем хрупкие, аккуратно садятся мне на нос, щёки, ресницы и тут же тают. От каждого этого мимолётного «поцелуя» зимы я ощущаю, как по спине бегут мурашки."

    "Дежавю. Я точно уже был здесь, но чего-то или кого-то не хватает…"

    mc "Выходи! Я знаю, что ты здесь!"

    "Но никто не пришёл."

    hide snow1
    hide snow2
    with dissolve
    stop background

    play sound signal

    scene bg_room_dawn with onn

    "Меня разбудил будильник из соседней комнаты. Стены в общаге тонкие, так что нередко я просыпался от шума соседей."
    stop sound

    "Мне определённо снился этот сон раньше… Но в этот раз там не было её. Я ворочался с одного бока на другой, думая, в чём причина её исчезновения."

    "Ответ пришёл мне в голову довольно быстро. Ночная гостья не появилась из-за амулета."

    "Теперь сомнений не было — этот амулет и вправду меня защищает. Но, пожалуй, мне уже пора перестать защищаться и убегать от проблемы, хватит игнорировать её. Нужно вернуть оберег и разобраться со всем самому."

    scene bg_uni_morning with dissolve

    play music wholesome
    play background people

    "В вузе витала атмосфера всеобщего волнения и переживания."

    "Возле пыточной, то есть аудитории, уже толпилось множество моих одногруппников. Возле окна стоял парень, которого я видел, кажется, впервые за семестр. Стоял он с таким уверенным лицом, будто бы пятёрка у него уже была в кармане."

    "Рядом с ним была группа друзей, тоже моих одногруппников. Они стояли и шутили о том, как их отчислят, как они не сдадут экзамен и пойдут работать на завод за еду."

    "Так как никто не хотел признаваться и серьезно говорить о своих переживаниях, они предпочитали шутить по поводу своих опасений. Справедливости ради, шутить по поводу экзаменов и вправду успокаивает больше, чем серьёзно их обсуждать."

    "Шнурок стоял и общался с моей одногруппницей. Все знают, что он, скорее всего, без проблем сдаст этот экзамен. И он это знает. Также он знает, что мы-то имеем большие шансы не сдать, а он будто бы несёт ответственность за нас всех поголовно."

    "Шнурок носился туда-сюда, опрашивая всех, кто попадётся на пути. То ли с целью оценить потенциальный урон успеваемости группы, то ли в надежде, что за минутный разговор человек получит достаточные знания для сдачи экзамена. Одной из его жертв стал и я."

    show alex normala at right2 with dissolve

    a "Ты готов?"

    #show mc sada at left2 with dissolve
    show mc sad ca at left2 with dissolve
    mc "Я не очень уверен в оценке, жутко нервничаю."

    show alex smilea at right2 with dissolve
    a "Я наоборот не сомневаюсь в отличной отметке. Может, мне тебя поспрашивать по темам?"

    #show mc smile crosseda at left2 with dissolve
    show mc smile crossed ca at left2 with dissolve

    mc "Давай."

    "Шнурок улыбнулся так, что не ясно для кого эта викторина затевается. Он встал на цыпочки, а потом резко приземлился, источая энтузиазм. Подняв палец вверх, он спросил:"

    show alex normala at right2 with dissolve
    a "Вопрос один! Для разогрева что-нибудь простое… Например, от какого слова образовано доменное имя .com?"

    menu:

        "Комар":
            show alex normala at right2 with dissolve
            "Шнурок отрицательно помотал головой."
            #show mc sada at left2 with dissolve
            show mc sad ca at left2 with dissolve
            a "Ну… Всякое случается. Ответ: Коммерческий. Ничего, вопрос номер два!"
        "Коммерческий":
            show alex smilea at right2 with dissolve
            "Шнурок улыбнулся и кивнул."
            a "Так держать! Итак, вопрос номер два."
            show alex normala at right2 with dissolve
        "Комиссионный":
            show alex normala at right2 with dissolve
            "Шнурок отрицательно помотал головой."
            #show mc sada at left2 with dissolve
            show mc sad ca at left2 with dissolve
            a "Ну… Всякое случается. Ответ: Коммерческий. Ничего, вопрос номер два!"
        "Командировочный":
            show alex normala at right2 with dissolve
            "Шнурок отрицательно помотал головой."
            #show mc sada at left2 with dissolve
            show mc sad ca at left2 with dissolve
            a "Ну… Всякое случается. Ответ: Коммерческий. Ничего, вопрос номер два!"

    #show mc normala at left2 with dissolve
    show mc normal ca at left2 with dissolve
    show alex normala at right2 with dissolve
    a "Второй вопрос простой — как называют приложения для поиска и устранения вредоносных программ на ПК?"

    menu:

        "Антивирус":
            show alex smilea at right2 with dissolve
            #show mc smile crosseda at left2 with dissolve
            show mc smile crossed ca at left2 with dissolve
            a "Другого я от тебя и не ожидал. Итак, поехали к настоящему вопросу. Цветочки кончились."
        "Стражник":
            show alex gloomya at right2 with dissolve
            #show mc sada at left2 with dissolve
            show mc sad ca at left2 with dissolve
            a "Серьёзно? Ты не знаешь про антивирус? Дружище, хватит шутки шутить, давай-ка соберись! Итак, поехали к настоящему вопросу. Цветочки кончились."
        "Египтянин":
            show alex gloomya at right2 with dissolve
            #show mc sada at left2 with dissolve
            show mc sad ca at left2 with dissolve
            a "Серьёзно? Ты не знаешь про антивирус? Дружище, хватит шутки шутить, давай-ка соберись! Итак, поехали к настоящему вопросу. Цветочки кончились."

        "Будка":
            show alex gloomya at right2 with dissolve
            #show mc sada at left2 with dissolve
            show mc sad ca at left2 with dissolve
            a "Серьёзно? Ты не знаешь про антивирус? Дружище, хватит шутки шутить, давай-ка соберись! Итак, поехали к настоящему вопросу. Цветочки кончились."

    #show mc normala at left2 with dissolve
    show mc normal ca at left2 with dissolve
    show alex normala at right2 with dissolve
    a "Вопрос в следующем — в каком институте был разработан первый механический аналоговый компьютер?"

    "Он уставился на меня, ожидая ответа. Ответа я не знаю. Так, Я, соберись! Какие есть варианты…"

    menu:
        "МГУ":
            pass
        "Хогвартс":
            pass
        "Гарвард":
            pass
        "Оксфорд":
            pass

    show alex gloomya at right2 with dissolve
    "Когда я ответил, я сразу понял, что я ответил неправильно. В принципе, я и так знал, что не знаю, но взгляд Шнурка будто бы усилил моё чувство стыда в 10 раз. Он вздохнул и сказал:"
    show alex normala at right2 with dissolve

    a "Не-а. В Массачусетском. В 1927 году. Вэниваром Бушем. Что ж, удачи тебе! Мне нужно отойти."
    hide alex normala at right2 with dissolve

    n "Он повернулся и ушёл."
    stop music fadeout 2.0
    #show mc thoughtful crosseda at left2 with dissolve
    show mc thoughtful crossed ca at left2 with dissolve

    "Сказать, что эта викторина выбила у меня землю из-под ног и серьёзно ударила по моей уверенности — это ничего не сказать."

    "Я стоял перед дверью, пытаясь высчитать свои шансы на лёгкий билет, а в голове крутилась картинка пересдачи, а потом отчисления, а потом работы на заводе за еду вместе с теми парнями-шутниками."

    "Мне очень хотелось сейчас подойти к ним и тоже пошутить как-нибудь, пока из аудитории не донеслась моя фамилия с просьбой подойти."

    #hide mc thoughtful crosseda at left2 with dissolve
    hide mc thoughtful crossed ca at left2 with dissolve

    "Держа образ незнакомки в голове, загадка которой продолжала меня напрягать, я перешагнул через порог, взял билет и сел на место."

    play background room
    scene bg_classroom with dissolve

    "Мне очень повезло — билет попался удачный. Я знал почти всё, кроме одного нюанса, который всё время висел у меня на языке, но вспомнить его я так и не смог, поэтому мне поставили 4. Хоть возможность выйти на 5 и была, я не расстроился."

    "При оглашении оценки в голове у меня всплыло лицо Шнурка, и я гордо улыбнулся, вспоминая весь тот ужас, который заставила меня пережить его викторина."

    scene bg_uni_day with dissolve

    "Помяни чёрта — он и появится. Стоило мне выйти из аудитории, как меня подловил староста."

    show alex normala at right2 with dissolve

    a "[mcname], где Женя? Она всё ещё не появилась на экзамене."

    #show mc thoughtful crosseda at left2 with dissolve
    show mc thoughtful crossed ca at left2 with dissolve

    mc "Не знаю, но она придёт, я уверен. Возможно, проспала…"

    a "Найди её, или ей поставят незачёт!"

    play music mystery
    scene black with dissolve
    "Сердце заколотилось в груди, когда я узнал, что Женя не пришла на экзамен. По дороге в общагу я несколько раз пытался дозвониться до Жени, но меня встречал только голос автоответчика."

    "Что происходит? Почему она не отвечает на звонки? Мрачные мысли вихрем пронеслись в моей голове."

    scene bg_hallway_day with dissolve

    "Оказавшись в общежитии, я бросился к комнате Жени. Но мои поиски оказались безрезультатны. Ни в комнате, ни на кухне — нигде её не было."

    "Посещало чувство, что я опоздал, упустил что-то важное. С тяжестью на сердце я побрёл в свою комнату."

    scene bg_room_dawn #at pan
    with dissolve

    "В моей берлоге было как всегда тихо и одиноко. На мгновение мне даже захотелось снять амулет, чтобы хоть призрак успокаивал меня своим тихим присутствием."

    scene cj_ticket_1 with dissolve

    "Моё внимание привлекла какая-то бумажка на моём столе. Присмотревшись, я не поверил своим глазам: это был распечатанный билет на самолёт. Я не собирался никуда лететь и уж тем более на юг."

    "Казалось бы, бессмыслица, но в уголке билета я заметил маленькую надпись «Прости» и нарисованного грустного котика."

    scene cj_ticket_2 with dissolve

    "Это не мой билет, а Женин. Она улетает домой. Но почему и когда? Может, я ещё могу догнать её?"
    scene cj_ticket_3 with dissolve

    "На билете было указано время: 16:30. Сверив с часами, я понял, что самолёт только что взлетел."

    "Женя скрылась за завесой облаков, оставив меня лишь с билетом в руках. Волны смятения, разочарования и необъяснимой тревоги захлестнули меня. Я сел на стул и закрыл лицо руками. Все мои планы и надежды рассыпались в прах с этим одним исчезновением."

    #scene cj_goodbye with dissolve

    #$ persistent.poster5 = True
    pause 2

    stop music fadeout 2.0
    $ set_quick_menu(False)
    scene black with dissolve
    play background wind

    centered "{size=+24}{color=#ffffff}Давай помогу начать всё сначала."

    $ persistent.ending2 = True
    stop background fadeout 1.0

    return
